Setup.org
#+TITLE: Setup Stuff
#+OPTIONS: toc nil

This file documents some of the crazy things that I have to do n order
to have all of my dependencies available.

* Overall
** Emacs stuff 
I'll need to keep this updated, when Emacs gets version bumped.

#+BEGIN_SRC sh
wget https://www.dropbox.com/download?dl=packages/ubuntu/dropbox_2015.10.28_amd64.deb
#+END_SRC

#+BEGIN_SRC sh :results none :eval no
  cd ~
  sudo apt-get install build-dep emacs24
  git clone git://git.savannah.gnu.org/emacs.git

#+END_SRC

#+BEGIN_SRC sh :eval no
   cd ~/emacs
    ./autogen.sh
    ./configure
    make
#+END_SRC


#+BEGIN_SRC sh :results none
  sudo make install
#+END_SRC
Seperate out the sudo parts, to prevent breakages.
