Setup.org
*** Lisp Hacking!

#+BEGIN_SRC elisp
(defvar file (buffer-file-name))
(setq buf "/home/richie/Dropbox/Thesis/func.R")
(defun rm-formatr (buf)
  "Format given buffer with formatR"
  (interactive "bchoose buffer:")
  (let file (buffer-file-name buf))
       (ess-command (format "formatR::tidy_source(\"%s\")" file) buf))

(rm-formatr "func.R")

#+END_SRC

- if I set the buf variable it works
- ess-command has an outbuf parameter to store the results
- can theoretically diff this
** Power Stuff

#+BEGIN_SRC sh
  sudo add-apt-repository ppa:linrunner/tlp
  sudo apt-get update
  sudo apt-get install tlp tlp-rdw
  sudo apt-get install tp-smapi-dkms acpi-call-tools
#+END_SRC


Add thinkpad/Linux related power saving functions. The joy of tlp is that it just works, rather than requiring me to mess around with kernel settings.
** LaTeX

#+BEGIN_SRC sh
  sudo apt-get install texlive-full
#+END_SRC

Overkill, but I don't like error messages when running LaTeX.

#+BEGIN_SRC sh
  sudo apt-get install pandoc
#+END_SRC

Pandoc is great for converting one format to another, and supports word, which is nice.

** Python stuff

*** TODO Document conda installation
- conda handles binary dependencies, which is better than pip
 #+BEGIN_SRC sh :session :results none
  sudo apt-get install python3-numpy python3-scipy python3-pip
 #+END_SRC

 Get Numpy, Scipy and Pip.

 I have installed so much Python without recording it here.
 #+BEGIN_SRC sh
conda install -c conda-forge autopep8 yapf flake8
conda install -c steamelephant importmagic 
 #+END_SRC

 - Install stuff for elpy
 #+RESULTS:

#+BEGIN_SRC sh
curl https://repo.anaconda.com/archive/Anaconda3-5.1.0-Linux-x86_64.sh
bash Anaconda-latest-Linux-x86_64.sh

#+END_SRC

- conda needs a new link each time

#+BEGIN_SRC sh setup_py.sh
  conda install scipy numpy sklearn pandas seaborn torch torch-vision requests 

#+END_SRC

#+BEGIN_SRC lisp :tangle python.el
;; (setq exec-path (append  '("~/anaconda3/bin") exec-path))
;; (when (executable-find "jupyter")
;;   (setq
;;    python-shell-interpreter "jupyter"
;;    python-shell-interpreter-args "console --simple-prompt"
;;    python-shell-prompt-regexp "In \\[[0-9]+\\]: "
;;    python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: "
;;    python-shell-completion-setup-code
;;    "from IPython.core.completerlib import module_completion"
;;    python-shell-completion-module-string-code
;;    "';'.join(module_completion('''%s'''))\n"
;;    python-shell-completion-string-code
;;    "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"))
(setq python-shell-interpreter "jupyter")
(setq python-shell-interpreter-args "console")

(elpy-enable)
#+END_SRC

** Webserver stuff
#+BEGIN_SRC sh
  sudo apt-get install php7 mysql apache2
#+END_SRC


Because I'll need it at some point.

#+BEGIN_SRC sh
  # installs add-apt-repository
  sudo apt-get install software-properties-common

  sudo apt-key adv --recv-keys --keyserver hkp://keyserver.ubuntu.com:80 0x5a16e7281be7a449
  sudo add-apt-repository "deb http://dl.hhvm.com/ubuntu $(lsb_release -sc) main"
  sudo apt-get update
  sudo apt-get install hhvm
#+END_SRC



** Deep Learning related stuff
#+BEGIN_SRC sh
  sudo ln -s /usr/lib/nvidia-cuda-toolkit/bin/gcc /usr/bin/gcc-4.9
  sudo ln -s  /usr/lib/nvidia-cuda-toolkit/bin/g++ usr/bin/g++-4.9

#+END_SRC

#+RESULTS:

Need some magic to work around nvcc using old version of gcc.
This magic works on

#+BEGIN_SRC sh
cat /etc/release
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results output
  cat /etc/nvcc.profile
#+END_SRC

#+RESULTS:
#+begin_example
# Syntax:
#   name  = <text>   assignment
#   name ?= <text>   conditional assignment
#   name += <text>   prepend
#   name =+ <text>   append
# Predefined variables: _SPACE_, _HERE_, _TARGET_DIR_, _TARGET_SIZE_

NVVMIR_LIBRARY_DIR = /usr/lib/nvidia-cuda-toolkit/libdevice

PATH		+= /usr/lib/nvidia-cuda-toolkit/bin:

#INCLUDES	+=

LIBRARIES	=+ $(_SPACE_) -L/usr/lib/x86_64-linux-gnu/stubs

#CUDAFE_FLAGS	+=
#PTXAS_FLAGS	+=
#+end_example

Grab the path, and alter the symlinks above to point to the same directory as nvcc

** GCC 4<5
The transition has caused me some difficulty.

#+BEGIN_SRC sh
  sudo apt-get-install g++-4.9.10
  sudo update-alternatives --install /usr/bin/g++ g++ /usr/bin/g++-4.9 10
#+END_SRC
Otherwise, CUDA is unavailable.

- This happened again, this time with gcc6-7

- hopefully the same approach applies

#+BEGIN_SRC sh

#+END_SRC


*** Torch (Lua)
#+BEGIN_SRC sh
  cd ~
  curl -s https://raw.githubusercontent.com/torch/ezinstall/master/install-deps | bash
  git clone https://github.com/torch/distro.git ~/torch --recursive
  cd ~/torch; ./install.sh
#+END_SRC
next get iTorch
#+BEGIN_SRC sh
  cd ~
  git clone https://github.com/facebook/iTorch.git
  cd iTorch
  luarocks make
#+END_SRC

Torch was super easy. Tensor Flow wasn't that much harder (but sure did require a lot of steps).


*** TensorFlow

#+BEGIN_SRC sh
  sudo apt-get install pkg-config zip g++ zlib1g-dev unzip
  ##you need cudnn, typically I have it in Downloads.
  git clone --recursive-submodules https://github.com/tensorflow/tensorflow
#+END_SRC

#+BEGIN_SRC sh
  cd tensorflow;
  ./configure
  bazel build -c opt --config=cuda //tensorflow/cc:tutorials_example_trainer

#+END_SRC

Hmmm, it certainly seemed much harder than that.
I can guarentee that it takes a long time, and it uses all of your available cores.
____Elapsed time: 2342.696s, Critical Path: 2321.72s (according to bazel build).
And I couldn't get it to work :(

*** TODO PyTorch (document install)
- this is pretty easy, but I don't have it done
** Missing Libraries



#+BEGIN_SRC sh :tangle setup.sh
  sudo apt-get install apt-file
  sudo apt-file update
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :session :eval maybe
  sudo apt-file search proj_api.h
#+END_SRC

Returns libproj-dev, so next step is to install that.

#+BEGIN_SRC sh :eval maybe
  sudo apt-get install libproj-dev
#+END_SRC

Get apt-file, so that we can search for missing libraries throughout this process.


** R related stuff

#+BEGIN_SRC R :session :eval maybe :tangle setup_r.R
  update.packages(ask=FALSE)
install.packages(c("ggplot2", "dplyr", "lubridate", "tidyr", "psych", "caret", "devtools", "broom"))
install.packages(c("tidyverse", "forecast", "modelr", "pryr", "magrittr", "glmnet", "randomForest", "lintr", "xtable", "testthat"))
install.packages(c("lintr", "h2o", "sparklyr", "xgboost", "rstan", "rstanarm"))
#+END_SRC

Install the essentials of the tidyverse.

#+BEGIN_SRC R :session :eval maybe
#+END_SRC

This actually does most of the work.

#+BEGIN_SRC R :session :eval maybe
  install.packages("pryr")
#+END_SRC
Useful for inspecting R objects.


#+BEGIN_SRC R :session :eval no
  install.packages("forecast")
#+END_SRC

#+RESULTS:

Super useful for time series

 $A = \pi*r^{2}$

** Bashrc

#+BEGIN_SRC sh
export PATH=/home/richie/anaconda3/bin:$PATH:
alias tp="ping 8.8.8.8"
#+END_SRC

- need to figure out how to append to an existing file
- this is easy, it's just >> (double arrow)
